package com.telran.lesson25;

import java.util.Date;

public class DataExample {

    public static void main(String[] args) {

        Date date = new Date();
        System.out.println(date);

        //TODO HW
//Написать регулярку для проверки номер телефона и тесты на нее(парам)
//1234567 , 123-4567, 123 5678

//Регулярка для проверки пароля: At least 1 UpperCase, 1 spec(@#$), length min 8


    }
}
